Repository: martenrebane/MOPP-iOS
Catalog: SkSigningLib/SkSigningLib/Supporting Files/*.lproj/Localizable.strings
Languages: et, ru

# general-signature-adding-error
source: Failed to sign container
et: Ümbriku allkirjastamine ebaõnnestus

# mid-rest-error-unknown
source: Unknown error occurred when signing with mobile-ID
et: Tundmatu viga mobiil-ID'ga allkirjastamisel
ru: Неизвестная ошибка при подписании с помощю mobiil-ID

# mid-rest-error-general
source: Something went wrong. Please try again
et: Midagi läks valesti. Palun proovi uuesti
ru: Что-то полшло не так. Пожалуйста, попробуйте еще раз

# mid-rest-error-incorrect-parameters
source: Please include correct country code
et: Telefoninumber peab sisaldama riigikoodi
ru: Номер телефона должен содержать код страны

# mid-rest-error-not-mobile-id-user
source: User is not a mobile-ID client
et: Kasutaja ei ole mobiil-ID klient
ru: Пользователь не является клиентом mobiil-ID

# mid-rest-error-user-cancelled
source: User denied or cancelled
et: Kasutaja keeldus või katkestas
ru: Пользователю отказано

# mid-rest-error-timeout
source: Your mobile-ID transaction has expired. Please try again
et: Sinu mobiil-ID toiming aegus. Palun proovi uuesti
ru: Срок действия вашей транзакции mobiil-ID истек. Пожалуйста, попробуйте еще раз

# mid-rest-error-delivery-error
source: Request sending error
et: Päringu saatmise viga
ru: Ошибка запроса

# mid-rest-error-sim-error
source: SIM error
et: SIM-kaardi viga
ru: Ошибка SIM-карты

# mid-rest-error-phone-absent
source: Phone is not in coverage area
et: Telefon ei ole levis
ru: Отказ - телефон вне сети

# mid-rest-error-signature-hash-mismatch
source: Your mobile-ID transaction has failed. Please contact your mobile network operator
et: Sinu mobiil-ID toiming ebaõnnestus. Palun võta ühendust enda mobiilioperaatoriga
ru: Не удалось выполнить операцию mobiil-ID. Пожалуйста, свяжитесь со своим мобильным оператором

# mid-rest-error-no-response
source: Please check your internet connection
et: Palun kontrolli internetiühendust
ru: Пожалуйста проверьте подключение к интернету

# mid-rest-error-exceeded-unsuccessful-requests
source: Failed to send request. The number of unsuccessful request from this IP address has been exceeded. Please try again later.
et: Päringu saatmine ebaõnnestus. Sellelt IP-aadressilt on ebaõnnestunud päringute arv ületatud. Palun proovi mõne aja pärast uuesti.
ru: Не удалось отправить запрос. Превышено количество неудачных запросов с этого IP-адреса. Пожалуйста, попробуйте позже.

# mid-rest-error-ocsp-invalid-time-slot
source: Please check your smart device time. https://www.id.ee/en/article/ria-digidoc-error-please-check-your-smart-device-time/
et: Palun kontrolli oma nutiseadme kellaaega. https://www.id.ee/artikkel/ria-digidoc-viga-palun-kontrollige-oma-nutiseadme-kellaaega/
ru: Пожалуйста, проверьте время на своем смарт-устройстве. https://www.id.ee/ru/artikkel/oshibka-ria-digidoc-pozhalujsta-proverte-vremya-na-svoem-smart-ustrojstve/

# mid-rest-error-invalid-ssl-cert
source: SSL handshake failed. Check your application settings or software upgrades
et: SSL ühenduskanali loomine ebaõnnestus. Kontrolli rakenduse seadeid või tarkvara uuendusi
ru: Не удалось создать SSL канал передачи данных. Проверьте настройки вашего приложения или обновления программного обеспечения

# mid-rest-error-invalid-access-rights
source: Check your mobile-ID service access settings. https://www.id.ee/en/article/for-organisations-that-sign-large-quantities-of-documents-using-digidoc4-client/
et: Kontrolli mobiil-ID teenuse ligipääsu seadeid. https://www.id.ee/artikkel/asutustele-kus-allkirjastatakse-digidoc4-kliendi-kaudu-suuremates-kogustes-dokumente/
ru: Не удалось подписать контейнер. Проверьте настройки доступа услуги mobiil-ID. https://www.id.ee/ru/artikkel/dlya-uchrezhdenij-v-kotoryh-v-bolshom-obeme-podpisyvayutsya-dokumenty-s-pomoshhyu-digidoc4-klienta/

# mid-rest-error-technical-error
source: Failed to send request. Mobile-ID service has encountered technical errors. Please try again later.
et: Päringu saatmine ebaõnnestus. Mobiil-ID teenuses esinevad tehnilised tõrked. Palun proovi mõne aja pärast uuesti.

# sid-rest-error-invalid-access-rights
source: Check your Smart-ID service access settings. https://www.id.ee/en/article/for-organisations-that-sign-large-quantities-of-documents-using-digidoc4-client/
et: Kontrolli Smart-ID teenuse ligipääsu seadeid. https://www.id.ee/artikkel/asutustele-kus-allkirjastatakse-digidoc4-kliendi-kaudu-suuremates-kogustes-dokumente/
ru: Не удалось подписать контейнер. Проверьте настройки доступа услуги Smart-ID. https://www.id.ee/ru/artikkel/dlya-uchrezhdenij-v-kotoryh-v-bolshom-obeme-podpisyvayutsya-dokumenty-s-pomoshhyu-digidoc4-klienta/

# sid-rest-error-wrong-vc
source: Error: an incorrect control code was chosen
et: Viga: valiti vale kontrollkood
ru: Ошибка: выбран неправильный контрольный код

# sid-rest-error-document-unusable
source: Your Smart-ID transaction has failed. Please check your Smart-ID application or contact Smart-ID customer support.
et: Sinu Smart-ID toiming ebaõnnestus. Palun kontrolli Smart-ID rakendust või võta ühendust Smart-ID klienditoega.
ru: Не удалось выполнить операцию Smart-ID. Пожалуйста, проверьте приложение Smart-ID или свяжитесь со службой поддержки Smart-ID.

# sid-rest-error-not-qualified
source: Your Smart-ID certificate level must be qualified to sign documents in RIA DigiDoc mobile application.
et: RIA DigiDoc mobiilirakenduses allkirjastamiseks peab sinu Smart-ID vastama tasemele kõrge.
ru: Для проставления подписи в мобильном приложении RIA DigiDoc, ваш Smart-ID должен соответствовать уровню "высокий".

# sid-rest-error-old-api
source: RIA DigiDoc mobile application needs an upgrade. Please install new version from the mobile app store. Additional info is available ID-helpline (+372) 666 8888.
et: RIA DigiDoc mobiilirakendus vajab uuendamist. Paigalda uus versioon mobiilirakenduse poest. Lisainfo ID-abiliini telefonil (+372) 666 8888.
ru: Мобильное приложение RIA DigiDoc нуждается в обновлении. Пожалуйста, установите новую версию из магазина мобильных приложений. Дополнительную информацию можно получить по телефону (+372) 666 8888.

# sid-rest-error-under-maintenance
source: Failed to send request. Smart-ID service has encountered technical errors. Please try again later.
et: Päringu saatmine ebaõnnestus. Smart-ID teenuses esinevad tehnilised tõrked. Palun proovi mõne aja pärast uuesti.
ru: Технический сбой услуги Smart-ID. Пожалуйста, попробуйте позже.

# sid-rest-error-forbidden
source: Check your Smart-ID service access settings. https://www.id.ee/en/article/for-organisations-that-sign-large-quantities-of-documents-using-digidoc4-client/
et: Kontrolli Smart-ID teenuse ligipääsu seadeid. https://www.id.ee/artikkel/asutustele-kus-allkirjastatakse-digidoc4-kliendi-kaudu-suuremates-kogustes-dokumente/
ru: Не удалось подписать контейнер. Проверьте настройки доступа услуги Smart-ID. https://www.id.ee/ru/artikkel/dlya-uchrezhdenij-v-kotoryh-v-bolshom-obeme-podpisyvayutsya-dokumenty-s-pomoshhyu-digidoc4-klienta/

# sid-rest-error-account-not-found-or-timeout
source: Your Smart-ID transaction has expired or user account not found.
et: Sinu Smart-ID toiming aegus või kontot ei leitud.

# sid-rest-error-certificate-revoked
source: Certificate status revoked
et: Sertifikaat on kehtetu
ru: Сертификат недействителен
