Repository: martenrebane/MOPP-iOS
Catalog: MoppLib/*.lproj/Localizable.strings
Languages: et, ru

# action-cancel
source: Cancel
et: Tühista
ru: Отменить

# action-yes
source: Yes
et: Jah

# action-no
source: No
et: Ei

# container-details-enter-pin1
source: Please enter your PIN1 code.
et: Palun sisesta PIN1 kood.
ru: Введите PIN1

# container-details-enter-pin2
source: Please enter your PIN2 code.
et: Palun sisesta PIN2 kood.
ru: Введите PIN2

# container-details-enter-puk
source: Please enter your PUK code.
et: Palun sisesta PUK kood.
ru: Введите PUK

# pin-actions-wrong-pin-retry
source: Current %@ was wrong. You have %i tries left.
et: Kehtiv %@ on vale. Saad proovida veel %i korda.
ru: Текущий% @ был неправильным. Осталось попыток: %i

source: Select reader
et: Vali kaardilugeja
ru: Выберите устройство для чтения ID-карт

source: Cancel
et: Katkesta
ru: Отменить

# Connect reader message
source: Select bluetooth reader. Please make sure your reader is active and bluetooth is switched on.
et: Vali bluetooth kaardilugeja. Palun kontrolli, et lugeja oleks aktiivne ja bluetooth oleks sisse lülitatud.
ru: Выберите Bluetooth-считыватель. Убедитесь, что ваш считыватель активен и включен Bluetooth.

# Problem connecting %@
source: There was a problem connecting your reader: %@
et: Seadme ühendamisel tekkis probleem: %@
ru: Не удалось подключиться к вашему устройству чтения ID-карт: %@

source: Error
et: Viga
ru: Ошибка

# digidoc-service-status-request-sent
source: Signing request sent
et: Allkirjastamispäring saadetud
ru: Запрос на подпись отправлен

# digidoc-service-status-request-ok
source: Request accepted
et: Päring vastuvõetud
ru: Запрос принят

# digidoc-service-status-request-expired-transaction
source: Request timeout
et: Päringu ajalõpp
ru: Время запроса истекло

# digidoc-service-status-request-user-cancel
source: User denied or cancelled
et: Kasutaja katkestas
ru: Пользователю отказано

# digidoc-service-status-request-signature
source: Got signature
et: Allkiri saadud
ru: Подпись получена

# digidoc-service-status-request-outstanding-transaction
source: Request pending
et: Päring käimas
ru: Запрос в ожидании

# digidoc-service-status-request-mid-not-ready
source: Mobile-ID not ready, try again later
et: Mobiil-ID pole saadaval, proovi hiljem uuesti
ru: Mobiil-ID не готов, попробуйте позже

# digidoc-service-status-request-phone-absent
source: Phone is switched off or out of coverage
et: Telefon on välja lülitatud või asub väljaspool levi piirkonda
ru: Телефон выключен или находится вне зоны доступа

# digidoc-service-status-request-sending-error
source: Request sending error
et: Viga päringu saatmisel
ru: Ошибка запроса

# digidoc-service-status-request-sim-error
source: SIM application error
et: SIM-i tööriistakomplekti viga
ru: Ошибка SIM-приложения

# digidoc-service-status-request-not-valid
source: Signature is not valid
et: Allkiri ei ole kehtiv
ru: Подпись недействительна

# digidoc-service-status-request-revoked-certificate
source: Certificate revoked
et: Sertifikaat tühistatud
ru: Сертификаты отозваны

# digidoc-service-status-request-internal-error
source: Technical error
et: Tehniline viga
ru: Техническая ошибка

# digidoc-service-error-unknown
source: Unknown error occurred when signing with Mobile-ID
et: Tundmatu viga Mobiil-ID'ga allkirjastamisel
ru: Неизвестная ошибка при подписании с помощю Mobiil-ID

# digidoc-service-error-general
source: Something went wrong, try again
et: Midagi läks valesti, proovi uuesti
ru: Что-то полшло не так, попробуйте снова

# digidoc-service-error-incorrect-parameters
source: Incorrect mobile number and/or personal code, non-Estonian mobile numbers must be prefixed with the country code
et: Vigane telefoninumber ja/või isikukood, välismaa telefoninumber peab algama riigikoodiga
ru: Неверный номер телефона или/и личный код, не Эстонские номера телефонов должны начинаться с кода страны

# digidoc-service-error-missing-parameters
source: Missing mobile number and/or personal code
et: Puudub telefoninumber ja/või isikukood
ru: Отсутствует номер телефона или/и личный код

# digidoc-service-error-ocsp-unauthorized
source: Unable to access mobile signing service
et: Mobiilse allkirjastamise teenusele ei õnnestu ligi pääseda
ru: Сервис мобильной подписи недоступен

# digidoc-service-error-general-service
source: There was an error with Digidoc service, try again later
et: Viga Digidoc teenusega, proovi hiljem uuesti
ru: Ошибка сервиса DigiDoc, попробуйте позже

# digidoc-service-error-missing-user-certificate
source: Missing user certificate
et: Kasutaja sertifikaat puudub
ru: Отсутствует сертификат пользователя

# digidoc-service-error-certificate-validity-unknown
source: Unable to verify certificate validity
et: Sertifikaadi kehtivust ei õnnestu kontrollida
ru: Невозможно проверить действительность сертификата

# digidoc-service-error-session-locked
source: Mobile signing session is locked, try again later
et: Mobiilse allkirjastamise sessioon on lukustunud, proovi hiljem uuesti
ru: Сессия мобильной подписи заблокирована, попробуйте позже

# digidoc-service-error-general-user
source: An error occurred with the signers mobile phone
et: Viga Mobiil-ID kasutamisel kasutaja telefonis
ru: Ошабка приложения Mobiil-ID в телефоне пользователя

# digidoc-service-error-not-mobile-id-user
source: Not a Mobile-ID user
et: Pole Mobiil-ID kasutaja
ru: Не пользователь Mobiil-ID

# digidoc-service-error-user-certificate-revoked
source: Your mobile signing certificate is revoked
et: Teie Mobiil-ID allkirjastamise sertifikaat on tühistatud
ru: Ваш сертификат цифровой подписи отозван

# digidoc-service-error-user-certificate-status-unknown
source: Your mobile signing certificate status is unkown
et: Teie Mobiil-ID allkirjastamise sertifikaadi olek on teadmata
ru: Статус Вашего сертификата цифровой подписи неизвестен

# digidoc-service-error-user-certificate-suspended
source: Your mobile signing certificate is suspended
et: Teie Mobiil-ID'ga allkirjastamise sertifikaadi kehtivus on peatatud
ru: Ваш сертификат цифровой подписи временно приостановлен

# digidoc-service-error-user-certificate-expired
source: Your mobile signing certificate is expired
et: Teie Mobiil-ID allkirjastamise sertifikaat on aegunud
ru: Срок действительности Вашего сертификата цифровой подписи истек

# digidoc-service-error-message-exceeds-volume-limit
source: Too many datafiles in container
et: Liiga palju faile ühes konteineris
ru: Слишком много файлов в контейнере

# digidoc-service-error-message-too-many-requests
source: The limit for digital signatures per month has been reached for this IP address. https://www.id.ee/index.php?id=39023
et: Sinu IP-aadressi tasuta allkirjade kuulimiit on ületatud. Loe täpsemalt siit (https://id.ee/index.php?id=39021)
ru: Предел для цифровых подписей в месяц был достигнут для этого IP-адреса. https://www.id.ee/index.php?id=39025

# digidoc-service-error-simlutaneous-requests-limit-exceeded
source: Simultaneous requests limit exceeded
et: Samaaegsete pöördumiste limiit ületatud
ru: Превышен лимит подобный запросов

# digidoc-service-status-request-select-account
source: Confirm device for signing in Smart-ID application.
ru: Для проставления подписи подтвердите устройство в приложении Smart-ID.
